//---------------------- Pride Power------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//* Project Name       : S133
//* File Name          : MachineControl.h
//* Author             : judy
//* Version            : V1.0.0
//* Start Date         : 2016.2.14
//* Description        : 该文件用于状态转移判断头文件
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
extern unsigned char State177End;//177关闭继电器状态
extern unsigned char HighVolPowerOff;//高压直接下电2.5s之后
extern unsigned char OffState;//下电处理，状态机由30到40的条件
extern unsigned char PantographOff;
extern unsigned char ChangerINError;
extern void stateCodeTransfer(void);
extern unsigned char PowerOffError;//行车模式下电故障

extern unsigned int Error10S; //行车和受电弓故障下电10S延时
extern unsigned int Error5S;  //快充下电5S延时

extern unsigned char E10SOverFlag; //10S延时完成标志位
extern unsigned int Error20S; //行车和受电弓故障下电10S延时后的20S延时
extern unsigned int Error_30s_delay_cnt;
extern unsigned char TurnOffNRelay;

//********************************************************************************
//********************************************************************************
//********************************************************************************
//********************************************************************************
//********************************************************************************