//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//---------------------- Pride Power------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//* Project Name       : C50ES_FP
//* File Name          : spi.c
//* Author             : Judy
//* Version            : V1.0.0
//* Start Date         : 2011,05,26
//* Description        : 该程序针对9s12xep100的SPI模块进行配置
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
#include "derivative.h" /* include peripheral declarations */
#include "spi.h"
//////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////
unsigned char WRCFGR[6]={0xF3,0x00,0x00,0x00,0x92,0x94};  //Configuration (CFG) Register Group，WR
//unsigned char WRCFGR[6]={0xF3,0x00,0xF0,0x0F,0x64,0xA6};  //Configuration (CFG) Register Group，WR

//10-cell mode,Vref powered down No,设定测量周期:13ms,UV/OV比较周期:130ms
//0x8E --UV=3.4v,
//0x96 --OV=3.6v,

//0x92 --UV=3.5v,
//0x94 --OV=3.55v,

//**********************************************************************
//* Function name:   SPI_Init
//* Description:     SPI初始化// 速率500kbps 
//* EntryParameter : None
//* ReturnValue    : None
//**********************************************************************
void SPI_Init(void)
{								
    // SS引脚自动SS输出
    SPI0CR1  = 0x11;       //
    SPI0CR2  = 0x10;       //SS引脚自动SS输出 
    SPI0BR   = 0x70;      //BaudRateDivisor = (SPPR + 1)* 2^(SPR + 1)=2
                          //BaudRate = 1M/2 = 500K   
    SPI0CR1   = SPI0CR1|0x40; // SPI Enable

    // SS引脚自动SS输出
    SPI0CR1_SPE=    0;    //SPI不使能
    SPI0CR1_SPIE=   0;    //SPI接受中断不使能
    SPI0CR1_SPTIE=  0;    //SPI发生中断不使能
    SPI0CR1_MSTR=   1;    //1-主/0-从
    SPI0CR1_CPOL=   1;    //时钟极性选择  0--空闲时低/1--空闲时高
    SPI0CR1_CPHA=   1;    //时钟相位  0-奇数沿采样/1-偶数沿采样
    SPI0CR1_SSOE=   1;    //从选择输出使能
    SPI0CR1_LSBFE=  0;    //0-先传送高位(MSB)/1-先传送低位(LSB)

    SPI0CR2_MODFEN= 1;    //0-ss不用做SPI;1-ss取决于MODFEN
    SPI0BR=     0x01;    //BaudRateDivisor = (SPPR + 1)* 2^(SPR + 1)=2
                        //BaudRate = 2M/4 = 500K
    
    SPI0CR1_SPE=    1;    //SPI使能  
   
}
//**********************************************************************
//* Function name:   SPI_Write_Byte
//* Description:     写SPI一个字节程序
//* EntryParameter : 要写入的字节
//* ReturnValue    : None
//**********************************************************************
void SPI_Write_Byte(unsigned char val)
{
	  SPI0DR = val;
	  while(!(SPI0SR_SPTEF));
	  return;
}
//**********************************************************************
//* Function name:   SPI_Read_Byte
//* Description:     SPI读一个字节 
//* EntryParameter : None
//* ReturnValue    : 一个字节
//**********************************************************************
unsigned char SPI_Read_Byte(void)
{ 	
  	//while(!(SPIS_SPRF));
  	while(!(SPI0SR_SPIF));
  	return (unsigned char)SPI0DR;

}

