//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//---------------------- Pride Power------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//* Project Name       : C50ES_FP
//* File Name          : Storage.h
//* Author             : Judy
//* Version            : V1.0.0
//* Start Date         : 2015.7.13
//* Description        : 该文件是对CAN发送的报文进行BIT定义
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------

//
//
//////////////存储空间说明：
////////24c64中，0x0000~0x00ff:存放系统参数
////////////////////////////////////////////////////////////
/////////////////0x0100~0x0101: 存放参数结束标志位endflag1 ; 
//////////////////////////////////////////////////////////////
/////////////////0x0102~0x0103: 存放参数结束标志位endflag2 ; 
////////////////////////////////////////////////////////////
/////////////////0x0104~0x0105:存放SOC值;
///////////////////////////////////////////////////////////
/////////////////0x0106~0x0107:存放数据记录总条数
///////////////////////////////////////////////////////////////
/////////////////0x0110~0x0111: 存放绝缘的 K,B值，总共3组,6 bytes
/////////////////////////////////////////////////////////////////
/////////////////0x0112~0x0115:存放充电总容量
/////////////////0x0116~0x011a: 存放放电总容量
///////////////////////////////////////////////////////////////////////
////////at45db161中,0x210~0x9e0,存放历史数据记录，每分钟一条记录，共2000条
///////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////
#define ParaBaseAddr 0x0000	 //address in 24c64 系统参数
#define ENDFLAG_ADDR 0x0100  //address in 24c64 for endflag
#define SOC_ADDR     0x0104  //address in 24c64 for soc
#define Can_SOC_ADDR 0x0130  //address in 24c64 for 上报soc
#define Q1_ADDR      0x0134  //address in 24c64 for 额定容量
#define ERROR_COUNT_ADDR  0x0106// address in 24c64 for log counter
#define VPN_KB_ADDRESS    0x0110   //address in 24c64 for k1,k2,k3,b1,b2,b3

//#define AH_CHARGE_ADDR   0x0112  // capacity for charging
#define ChangerTime_ADDR   0x0186  // 充电次数
#define AH_CHARGE_ADDR   0x0196  // capacity for charging
#define AH_DISCHARGE_ADDR   0x0200  // capacity for charging
////////////
//#define ERROR_COUNT_ADDR 0x1e8000 //该地址越往后越好
#define DATA_ERROR_ADDR2  0x210  //in at45db161 历史故障记录从第二页开始保存  / Each page is 528 bytes  in at45db161
///////
//#define DATA_ERROR_ADDR ParaBaseAddr+0x3FF  //错误数据存储的起始地址 ,0x3ff之前的部分，用于存储系统阈值等默认参数：g_defaultSysParameters
//#define SUM_AH_ADDRESS  0xc8 //将累计总充放电安时数保存在第一页的第200个字节开始 in at45db161
//#define VPN_KB_ADDRESS    0x12c // K and B value for Vpn adrress in at45db161
#define TestEEPROM  0x1000


extern void LoadParamter(void);
extern void StoreParameter(void);
extern void StoreSocRealvalue(void);
extern float ReadOutSocStoreValue(void);
extern float ReadOutCanSocStoreValue(void);
extern void StoreQ1value(void);//
extern float ReadOutQ1StoreValue(void);
extern void StoreChargeDischargeAH(void);
extern void StoreChargeTime(void);
extern void ReadChargeDischargeAH(void);
extern void KB_DATA_RECALL(void);
extern void KB_DATA_SAVE(void);
//*******************************************************************************************
//********************************************************************************************
//*********************************************************************************************
//***********************************************************************************************