//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//---------------------- Pride Power------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//* Project Name       : C50ES_FP
//* File Name          : Task.h
//* Author             : Judy
//* Version            : V1.0.0
//* Start Date         : 2011,05,26
//* Description        : 该文件作为系统头文件，对该项目的系统参数进行定义和对所有全局变量进行全局声明
/////////////////////////////////////////////////////////////////////////////////////////////////////////


extern void TaskRemarks(void);
extern void TaskProcess(void);
extern void TaskRecordProcess(void);
extern void TaskCurrentDetect(void);
extern void TaskSocProcess(void);
extern void TaskBmuProcess(void);
extern void TaskReport2PC(void);
extern void TaskStatusMachine(void);